#+TITLE:      Emacs Stuff
#+AUTHOR:	Yaniv
#+EMAIL:	yanivdll@gmail.com
#+DATE:     2015-12-24
#+URI:        
#+STATUS:   draft
#+KEYWORDS:   
#+TAGS:       
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:2 \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 

**** Org mode

#+BEGIN_SRC emacs-lisp  :tangle no

(message "Hello, world!")

#+END_SRC 

#+RESULTS:
: Hello, world!



*** Lists
- ~cons~ - construct a list 
#+BEGIN_SRC emacs-lisp
(cons 1 '(3))

#+END_SRC

#+RESULTS:
| 1 | 3 |


~cons~ add an element to the head\top of a list. The list it should be added to must be quoted.

- ~car~ - split the list to its top element (head) and the rest (tail). ~car~ extract the head.

#+BEGIN_SRC emacs-lisp
(car '(1 4 6))

#+END_SRC

#+RESULTS:
: 1

- ~cdr~ - extract the tail of the list

#+BEGIN_SRC emacs-lisp
(cdr '(1 4 6))

#+END_SRC

#+RESULTS:
| 4 | 6 |

